SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_cpdma.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 CPDMA register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_CPDMA_H
#define EFR32FG25_CPDMA_H
#define CPDMA_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_CPDMA CPDMA
 * @{
 * @brief EFR32FG25 CPDMA Register Declaration.
 *****************************************************************************/

/** CPDMA FIFO Register Group Declaration. */
typedef struct {
  __IOM uint32_t CONN;                               /**< FIFO Connect Register                              */
} CPDMA_FIFO_TypeDef;

/** CPDMA CH Register Group Declaration. */
typedef struct {
  __IOM uint32_t CFG;                                /**< Channel's Configuration Register                   */
  __IOM uint32_t CTRL;                               /**< Channel's Control Register                         */
  __IOM uint32_t STARTADDR;                          /**< Channel's Data Start Addres Register               */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IM uint32_t  STAT;                               /**< Channel's Status Register                          */
  __IM uint32_t  CURRADDR;                           /**< Channel's Current Address                          */
  uint32_t       RESERVED1[6U];                      /**< Reserved for future use                            */
} CPDMA_CH_TypeDef;

/** CPDMA Register Declaration. */
typedef struct {
  __IM uint32_t      IPVERSION;                 /**< IP Version Register                                */
  __IOM uint32_t     EN;                        /**< Module Enable Register                             */
  __IOM uint32_t     SWRST;                     /**< Software Reset Register                            */
  __IOM uint32_t     CTRL;                      /**< CPDMA Control Register                             */
  __IM uint32_t      STATUS;                    /**< CPDMA Status Register                              */
  uint32_t           RESERVED0[4U];             /**< Reserved for future use                            */
  __IOM uint32_t     CHEN;                      /**< Channel Enable Register                            */
  __IOM uint32_t     CHDIS;                     /**< Channel Disable Register                           */
  __IM uint32_t      CHSTATUS;                  /**< Channel Status Register                            */
  __IM uint32_t      CHBUSY;                    /**< Channel Busy Register                              */
  __IOM uint32_t     CHDONEIF;                  /**< Channel Done Register                              */
  __IOM uint32_t     DBGHALT;                   /**< Debug Halt Register                                */
  __IOM uint32_t     SWREQ;                     /**< Software Transfer Request Register                 */
  __IOM uint32_t     REQDIS;                    /**< Request Disable Register                           */
  __IM uint32_t      REQPEND;                   /**< Request Pending Register                           */
  __IOM uint32_t     REQCLEAR;                  /**< Request Clear Register                             */
  __IOM uint32_t     FIFORST;                   /**< FIFO Reset Register                                */
  __IOM uint32_t     IF;                        /**< Interrupt Flag Register                            */
  __IOM uint32_t     IEN;                       /**< Interrupt Enable Register                          */
  __IOM uint32_t     ADDRMSKEN1;                /**< Address Mask 1 Enable Register                     */
  __IOM uint32_t     ADDRMSKEN2;                /**< Address Mask 2 Enable Registe                      */
  __IOM uint32_t     ADDRMSKEN3;                /**< Address Mask 3 Enable Register                     */
  __IOM uint32_t     ADDRMSKEN4;                /**< Address Mask 4 Enable Register                     */
  __IOM uint32_t     ADDRMSK;                   /**< Address Update Mask Register                       */
  __IOM uint32_t     SYNCUPMSK1;                /**< Sync Update Mask 1 Register                        */
  __IOM uint32_t     SYNCUPMSK2;                /**< Sync Update Mask 2 Register                        */
  __IOM uint32_t     SYNCENAB1;                 /**< Sync Enable 1 Register                             */
  __IOM uint32_t     SYNCENAB2;                 /**< Sync Enable 2 Register                             */
  __IOM uint32_t     SYNCINPTHRES;              /**< Sync Input Threshold Register                      */
  __IOM uint32_t     SYNCOUTTHRES;              /**< Sync Output Threshold Register                     */
  __IM uint32_t      SYNCCNTSTAT;               /**< Sync Count Status Register                         */
  uint32_t           RESERVED1[30U];            /**< Reserved for future use                            */
  CPDMA_FIFO_TypeDef FIFO[31U];                 /**< CPDMA FIFO Registers                               */
  uint32_t           RESERVED2[33U];            /**< Reserved for future use                            */
  CPDMA_CH_TypeDef   CH[31U];                   /**< CPDMA Channel Registers                            */
  uint32_t           RESERVED3[524U];           /**< Reserved for future use                            */
  __IM uint32_t      IPVERSION_SET;             /**< IP Version Register                                */
  __IOM uint32_t     EN_SET;                    /**< Module Enable Register                             */
  __IOM uint32_t     SWRST_SET;                 /**< Software Reset Register                            */
  __IOM uint32_t     CTRL_SET;                  /**< CPDMA Control Register                             */
  __IM uint32_t      STATUS_SET;                /**< CPDMA Status Register                              */
  uint32_t           RESERVED4[4U];             /**< Reserved for future use                            */
  __IOM uint32_t     CHEN_SET;                  /**< Channel Enable Register                            */
  __IOM uint32_t     CHDIS_SET;                 /**< Channel Disable Register                           */
  __IM uint32_t      CHSTATUS_SET;              /**< Channel Status Register                            */
  __IM uint32_t      CHBUSY_SET;                /**< Channel Busy Register                              */
  __IOM uint32_t     CHDONEIF_SET;              /**< Channel Done Register                              */
  __IOM uint32_t     DBGHALT_SET;               /**< Debug Halt Register                                */
  __IOM uint32_t     SWREQ_SET;                 /**< Software Transfer Request Register                 */
  __IOM uint32_t     REQDIS_SET;                /**< Request Disable Register                           */
  __IM uint32_t      REQPEND_SET;               /**< Request Pending Register                           */
  __IOM uint32_t     REQCLEAR_SET;              /**< Request Clear Register                             */
  __IOM uint32_t     FIFORST_SET;               /**< FIFO Reset Register                                */
  __IOM uint32_t     IF_SET;                    /**< Interrupt Flag Register                            */
  __IOM uint32_t     IEN_SET;                   /**< Interrupt Enable Register                          */
  __IOM uint32_t     ADDRMSKEN1_SET;            /**< Address Mask 1 Enable Register                     */
  __IOM uint32_t     ADDRMSKEN2_SET;            /**< Address Mask 2 Enable Registe                      */
  __IOM uint32_t     ADDRMSKEN3_SET;            /**< Address Mask 3 Enable Register                     */
  __IOM uint32_t     ADDRMSKEN4_SET;            /**< Address Mask 4 Enable Register                     */
  __IOM uint32_t     ADDRMSK_SET;               /**< Address Update Mask Register                       */
  __IOM uint32_t     SYNCUPMSK1_SET;            /**< Sync Update Mask 1 Register                        */
  __IOM uint32_t     SYNCUPMSK2_SET;            /**< Sync Update Mask 2 Register                        */
  __IOM uint32_t     SYNCENAB1_SET;             /**< Sync Enable 1 Register                             */
  __IOM uint32_t     SYNCENAB2_SET;             /**< Sync Enable 2 Register                             */
  __IOM uint32_t     SYNCINPTHRES_SET;          /**< Sync Input Threshold Register                      */
  __IOM uint32_t     SYNCOUTTHRES_SET;          /**< Sync Output Threshold Register                     */
  __IM uint32_t      SYNCCNTSTAT_SET;           /**< Sync Count Status Register                         */
  uint32_t           RESERVED5[30U];            /**< Reserved for future use                            */
  CPDMA_FIFO_TypeDef FIFO_SET[31U];             /**< CPDMA FIFO Registers                               */
  uint32_t           RESERVED6[33U];            /**< Reserved for future use                            */
  CPDMA_CH_TypeDef   CH_SET[31U];               /**< CPDMA Channel Registers                            */
  uint32_t           RESERVED7[524U];           /**< Reserved for future use                            */
  __IM uint32_t      IPVERSION_CLR;             /**< IP Version Register                                */
  __IOM uint32_t     EN_CLR;                    /**< Module Enable Register                             */
  __IOM uint32_t     SWRST_CLR;                 /**< Software Reset Register                            */
  __IOM uint32_t     CTRL_CLR;                  /**< CPDMA Control Register                             */
  __IM uint32_t      STATUS_CLR;                /**< CPDMA Status Register                              */
  uint32_t           RESERVED8[4U];             /**< Reserved for future use                            */
  __IOM uint32_t     CHEN_CLR;                  /**< Channel Enable Register                            */
  __IOM uint32_t     CHDIS_CLR;                 /**< Channel Disable Register                           */
  __IM uint32_t      CHSTATUS_CLR;              /**< Channel Status Register                            */
  __IM uint32_t      CHBUSY_CLR;                /**< Channel Busy Register                              */
  __IOM uint32_t     CHDONEIF_CLR;              /**< Channel Done Register                              */
  __IOM uint32_t     DBGHALT_CLR;               /**< Debug Halt Register                                */
  __IOM uint32_t     SWREQ_CLR;                 /**< Software Transfer Request Register                 */
  __IOM uint32_t     REQDIS_CLR;                /**< Request Disable Register                           */
  __IM uint32_t      REQPEND_CLR;               /**< Request Pending Register                           */
  __IOM uint32_t     REQCLEAR_CLR;              /**< Request Clear Register                             */
  __IOM uint32_t     FIFORST_CLR;               /**< FIFO Reset Register                                */
  __IOM uint32_t     IF_CLR;                    /**< Interrupt Flag Register                            */
  __IOM uint32_t     IEN_CLR;                   /**< Interrupt Enable Register                          */
  __IOM uint32_t     ADDRMSKEN1_CLR;            /**< Address Mask 1 Enable Register                     */
  __IOM uint32_t     ADDRMSKEN2_CLR;            /**< Address Mask 2 Enable Registe                      */
  __IOM uint32_t     ADDRMSKEN3_CLR;            /**< Address Mask 3 Enable Register                     */
  __IOM uint32_t     ADDRMSKEN4_CLR;            /**< Address Mask 4 Enable Register                     */
  __IOM uint32_t     ADDRMSK_CLR;               /**< Address Update Mask Register                       */
  __IOM uint32_t     SYNCUPMSK1_CLR;            /**< Sync Update Mask 1 Register                        */
  __IOM uint32_t     SYNCUPMSK2_CLR;            /**< Sync Update Mask 2 Register                        */
  __IOM uint32_t     SYNCENAB1_CLR;             /**< Sync Enable 1 Register                             */
  __IOM uint32_t     SYNCENAB2_CLR;             /**< Sync Enable 2 Register                             */
  __IOM uint32_t     SYNCINPTHRES_CLR;          /**< Sync Input Threshold Register                      */
  __IOM uint32_t     SYNCOUTTHRES_CLR;          /**< Sync Output Threshold Register                     */
  __IM uint32_t      SYNCCNTSTAT_CLR;           /**< Sync Count Status Register                         */
  uint32_t           RESERVED9[30U];            /**< Reserved for future use                            */
  CPDMA_FIFO_TypeDef FIFO_CLR[31U];             /**< CPDMA FIFO Registers                               */
  uint32_t           RESERVED10[33U];           /**< Reserved for future use                            */
  CPDMA_CH_TypeDef   CH_CLR[31U];               /**< CPDMA Channel Registers                            */
  uint32_t           RESERVED11[524U];          /**< Reserved for future use                            */
  __IM uint32_t      IPVERSION_TGL;             /**< IP Version Register                                */
  __IOM uint32_t     EN_TGL;                    /**< Module Enable Register                             */
  __IOM uint32_t     SWRST_TGL;                 /**< Software Reset Register                            */
  __IOM uint32_t     CTRL_TGL;                  /**< CPDMA Control Register                             */
  __IM uint32_t      STATUS_TGL;                /**< CPDMA Status Register                              */
  uint32_t           RESERVED12[4U];            /**< Reserved for future use                            */
  __IOM uint32_t     CHEN_TGL;                  /**< Channel Enable Register                            */
  __IOM uint32_t     CHDIS_TGL;                 /**< Channel Disable Register                           */
  __IM uint32_t      CHSTATUS_TGL;              /**< Channel Status Register                            */
  __IM uint32_t      CHBUSY_TGL;                /**< Channel Busy Register                              */
  __IOM uint32_t     CHDONEIF_TGL;              /**< Channel Done Register                              */
  __IOM uint32_t     DBGHALT_TGL;               /**< Debug Halt Register                                */
  __IOM uint32_t     SWREQ_TGL;                 /**< Software Transfer Request Register                 */
  __IOM uint32_t     REQDIS_TGL;                /**< Request Disable Register                           */
  __IM uint32_t      REQPEND_TGL;               /**< Request Pending Register                           */
  __IOM uint32_t     REQCLEAR_TGL;              /**< Request Clear Register                             */
  __IOM uint32_t     FIFORST_TGL;               /**< FIFO Reset Register                                */
  __IOM uint32_t     IF_TGL;                    /**< Interrupt Flag Register                            */
  __IOM uint32_t     IEN_TGL;                   /**< Interrupt Enable Register                          */
  __IOM uint32_t     ADDRMSKEN1_TGL;            /**< Address Mask 1 Enable Register                     */
  __IOM uint32_t     ADDRMSKEN2_TGL;            /**< Address Mask 2 Enable Registe                      */
  __IOM uint32_t     ADDRMSKEN3_TGL;            /**< Address Mask 3 Enable Register                     */
  __IOM uint32_t     ADDRMSKEN4_TGL;            /**< Address Mask 4 Enable Register                     */
  __IOM uint32_t     ADDRMSK_TGL;               /**< Address Update Mask Register                       */
  __IOM uint32_t     SYNCUPMSK1_TGL;            /**< Sync Update Mask 1 Register                        */
  __IOM uint32_t     SYNCUPMSK2_TGL;            /**< Sync Update Mask 2 Register                        */
  __IOM uint32_t     SYNCENAB1_TGL;             /**< Sync Enable 1 Register                             */
  __IOM uint32_t     SYNCENAB2_TGL;             /**< Sync Enable 2 Register                             */
  __IOM uint32_t     SYNCINPTHRES_TGL;          /**< Sync Input Threshold Register                      */
  __IOM uint32_t     SYNCOUTTHRES_TGL;          /**< Sync Output Threshold Register                     */
  __IM uint32_t      SYNCCNTSTAT_TGL;           /**< Sync Count Status Register                         */
  uint32_t           RESERVED13[30U];           /**< Reserved for future use                            */
  CPDMA_FIFO_TypeDef FIFO_TGL[31U];             /**< CPDMA FIFO Registers                               */
  uint32_t           RESERVED14[33U];           /**< Reserved for future use                            */
  CPDMA_CH_TypeDef   CH_TGL[31U];               /**< CPDMA Channel Registers                            */
} CPDMA_TypeDef;
/** @} End of group EFR32FG25_CPDMA */

/**************************************************************************//**
 * @addtogroup EFR32FG25_CPDMA
 * @{
 * @defgroup EFR32FG25_CPDMA_BitFields CPDMA Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for CPDMA IPVERSION */
#define _CPDMA_IPVERSION_RESETVALUE              0x00000001UL                              /**< Default value for CPDMA_IPVERSION           */
#define _CPDMA_IPVERSION_MASK                    0xFFFFFFFFUL                              /**< Mask for CPDMA_IPVERSION                    */
#define _CPDMA_IPVERSION_IPVERSION_SHIFT         0                                         /**< Shift value for CPDMA_IPVERSION             */
#define _CPDMA_IPVERSION_IPVERSION_MASK          0xFFFFFFFFUL                              /**< Bit mask for CPDMA_IPVERSION                */
#define _CPDMA_IPVERSION_IPVERSION_DEFAULT       0x00000001UL                              /**< Mode DEFAULT for CPDMA_IPVERSION            */
#define CPDMA_IPVERSION_IPVERSION_DEFAULT        (_CPDMA_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_IPVERSION    */

/* Bit fields for CPDMA EN */
#define _CPDMA_EN_RESETVALUE                     0x00000000UL                           /**< Default value for CPDMA_EN                  */
#define _CPDMA_EN_MASK                           0x00000003UL                           /**< Mask for CPDMA_EN                           */
#define CPDMA_EN_EN                              (0x1UL << 0)                           /**< Module Enable                               */
#define _CPDMA_EN_EN_SHIFT                       0                                      /**< Shift value for CPDMA_EN                    */
#define _CPDMA_EN_EN_MASK                        0x1UL                                  /**< Bit mask for CPDMA_EN                       */
#define _CPDMA_EN_EN_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for CPDMA_EN                   */
#define CPDMA_EN_EN_DEFAULT                      (_CPDMA_EN_EN_DEFAULT << 0)            /**< Shifted mode DEFAULT for CPDMA_EN           */
#define CPDMA_EN_DISABLING                       (0x1UL << 1)                           /**< Disablement Busy Status                     */
#define _CPDMA_EN_DISABLING_SHIFT                1                                      /**< Shift value for CPDMA_DISABLING             */
#define _CPDMA_EN_DISABLING_MASK                 0x2UL                                  /**< Bit mask for CPDMA_DISABLING                */
#define _CPDMA_EN_DISABLING_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for CPDMA_EN                   */
#define CPDMA_EN_DISABLING_DEFAULT               (_CPDMA_EN_DISABLING_DEFAULT << 1)     /**< Shifted mode DEFAULT for CPDMA_EN           */

/* Bit fields for CPDMA SWRST */
#define _CPDMA_SWRST_RESETVALUE                  0x00000000UL                           /**< Default value for CPDMA_SWRST               */
#define _CPDMA_SWRST_MASK                        0x00000003UL                           /**< Mask for CPDMA_SWRST                        */
#define CPDMA_SWRST_SWRST                        (0x1UL << 0)                           /**< Software Reset Command                      */
#define _CPDMA_SWRST_SWRST_SHIFT                 0                                      /**< Shift value for CPDMA_SWRST                 */
#define _CPDMA_SWRST_SWRST_MASK                  0x1UL                                  /**< Bit mask for CPDMA_SWRST                    */
#define _CPDMA_SWRST_SWRST_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for CPDMA_SWRST                */
#define CPDMA_SWRST_SWRST_DEFAULT                (_CPDMA_SWRST_SWRST_DEFAULT << 0)      /**< Shifted mode DEFAULT for CPDMA_SWRST        */
#define CPDMA_SWRST_RESETTING                    (0x1UL << 1)                           /**< Software Reset Busy Status                  */
#define _CPDMA_SWRST_RESETTING_SHIFT             1                                      /**< Shift value for CPDMA_RESETTING             */
#define _CPDMA_SWRST_RESETTING_MASK              0x2UL                                  /**< Bit mask for CPDMA_RESETTING                */
#define _CPDMA_SWRST_RESETTING_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for CPDMA_SWRST                */
#define CPDMA_SWRST_RESETTING_DEFAULT            (_CPDMA_SWRST_RESETTING_DEFAULT << 1)  /**< Shifted mode DEFAULT for CPDMA_SWRST        */

