SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_cpdma.h
/* Bit fields for CPDMA CTRL */
#define _CPDMA_CTRL_RESETVALUE                   0x00000000UL                           /**< Default value for CPDMA_CTRL                */
#define _CPDMA_CTRL_MASK                         0x00001F1FUL                           /**< Mask for CPDMA_CTRL                         */
#define _CPDMA_CTRL_NUMFIXEDIN_SHIFT             0                                      /**< Shift value for CPDMA_NUMFIXEDIN            */
#define _CPDMA_CTRL_NUMFIXEDIN_MASK              0x1FUL                                 /**< Bit mask for CPDMA_NUMFIXEDIN               */
#define _CPDMA_CTRL_NUMFIXEDIN_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for CPDMA_CTRL                 */
#define CPDMA_CTRL_NUMFIXEDIN_DEFAULT            (_CPDMA_CTRL_NUMFIXEDIN_DEFAULT << 0)  /**< Shifted mode DEFAULT for CPDMA_CTRL         */
#define _CPDMA_CTRL_NUMFIXEDOUT_SHIFT            8                                      /**< Shift value for CPDMA_NUMFIXEDOUT           */
#define _CPDMA_CTRL_NUMFIXEDOUT_MASK             0x1F00UL                               /**< Bit mask for CPDMA_NUMFIXEDOUT              */
#define _CPDMA_CTRL_NUMFIXEDOUT_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for CPDMA_CTRL                 */
#define CPDMA_CTRL_NUMFIXEDOUT_DEFAULT           (_CPDMA_CTRL_NUMFIXEDOUT_DEFAULT << 8) /**< Shifted mode DEFAULT for CPDMA_CTRL         */

/* Bit fields for CPDMA STATUS */
#define _CPDMA_STATUS_RESETVALUE                 0x1F010000UL                            /**< Default value for CPDMA_STATUS              */
#define _CPDMA_STATUS_MASK                       0x1F071FFBUL                            /**< Mask for CPDMA_STATUS                       */
#define CPDMA_STATUS_ANYBUSY                     (0x1UL << 0)                            /**< Any CPDMA Channel Busy                      */
#define _CPDMA_STATUS_ANYBUSY_SHIFT              0                                       /**< Shift value for CPDMA_ANYBUSY               */
#define _CPDMA_STATUS_ANYBUSY_MASK               0x1UL                                   /**< Bit mask for CPDMA_ANYBUSY                  */
#define _CPDMA_STATUS_ANYBUSY_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for CPDMA_STATUS               */
#define CPDMA_STATUS_ANYBUSY_DEFAULT             (_CPDMA_STATUS_ANYBUSY_DEFAULT << 0)    /**< Shifted mode DEFAULT for CPDMA_STATUS       */
#define CPDMA_STATUS_ANYREQ                      (0x1UL << 1)                            /**< Any CPDMA Channel Request Pending           */
#define _CPDMA_STATUS_ANYREQ_SHIFT               1                                       /**< Shift value for CPDMA_ANYREQ                */
#define _CPDMA_STATUS_ANYREQ_MASK                0x2UL                                   /**< Bit mask for CPDMA_ANYREQ                   */
#define _CPDMA_STATUS_ANYREQ_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for CPDMA_STATUS               */
#define CPDMA_STATUS_ANYREQ_DEFAULT              (_CPDMA_STATUS_ANYREQ_DEFAULT << 1)     /**< Shifted mode DEFAULT for CPDMA_STATUS       */
#define _CPDMA_STATUS_CHGRANT_SHIFT              3                                       /**< Shift value for CPDMA_CHGRANT               */
#define _CPDMA_STATUS_CHGRANT_MASK               0xF8UL                                  /**< Bit mask for CPDMA_CHGRANT                  */
#define _CPDMA_STATUS_CHGRANT_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for CPDMA_STATUS               */
#define CPDMA_STATUS_CHGRANT_DEFAULT             (_CPDMA_STATUS_CHGRANT_DEFAULT << 3)    /**< Shifted mode DEFAULT for CPDMA_STATUS       */
#define _CPDMA_STATUS_CHERROR_SHIFT              8                                       /**< Shift value for CPDMA_CHERROR               */
#define _CPDMA_STATUS_CHERROR_MASK               0x1F00UL                                /**< Bit mask for CPDMA_CHERROR                  */
#define _CPDMA_STATUS_CHERROR_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for CPDMA_STATUS               */
#define CPDMA_STATUS_CHERROR_DEFAULT             (_CPDMA_STATUS_CHERROR_DEFAULT << 8)    /**< Shifted mode DEFAULT for CPDMA_STATUS       */
#define _CPDMA_STATUS_ILEAVENUM_SHIFT            16                                      /**< Shift value for CPDMA_ILEAVENUM             */
#define _CPDMA_STATUS_ILEAVENUM_MASK             0x70000UL                               /**< Bit mask for CPDMA_ILEAVENUM                */
#define _CPDMA_STATUS_ILEAVENUM_DEFAULT          0x00000001UL                            /**< Mode DEFAULT for CPDMA_STATUS               */
#define CPDMA_STATUS_ILEAVENUM_DEFAULT           (_CPDMA_STATUS_ILEAVENUM_DEFAULT << 16) /**< Shifted mode DEFAULT for CPDMA_STATUS       */
#define _CPDMA_STATUS_CHNUM_SHIFT                24                                      /**< Shift value for CPDMA_CHNUM                 */
#define _CPDMA_STATUS_CHNUM_MASK                 0x1F000000UL                            /**< Bit mask for CPDMA_CHNUM                    */
#define _CPDMA_STATUS_CHNUM_DEFAULT              0x0000001FUL                            /**< Mode DEFAULT for CPDMA_STATUS               */
#define CPDMA_STATUS_CHNUM_DEFAULT               (_CPDMA_STATUS_CHNUM_DEFAULT << 24)     /**< Shifted mode DEFAULT for CPDMA_STATUS       */

/* Bit fields for CPDMA CHEN */
#define _CPDMA_CHEN_RESETVALUE                   0x00000000UL                           /**< Default value for CPDMA_CHEN                */
#define _CPDMA_CHEN_MASK                         0x7FFFFFFFUL                           /**< Mask for CPDMA_CHEN                         */
#define _CPDMA_CHEN_CHEN_SHIFT                   0                                      /**< Shift value for CPDMA_CHEN                  */
#define _CPDMA_CHEN_CHEN_MASK                    0x7FFFFFFFUL                           /**< Bit mask for CPDMA_CHEN                     */
#define _CPDMA_CHEN_CHEN_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_CHEN                 */
#define CPDMA_CHEN_CHEN_DEFAULT                  (_CPDMA_CHEN_CHEN_DEFAULT << 0)        /**< Shifted mode DEFAULT for CPDMA_CHEN         */

/* Bit fields for CPDMA CHDIS */
#define _CPDMA_CHDIS_RESETVALUE                  0x00000000UL                           /**< Default value for CPDMA_CHDIS               */
#define _CPDMA_CHDIS_MASK                        0x7FFFFFFFUL                           /**< Mask for CPDMA_CHDIS                        */
#define _CPDMA_CHDIS_CHDIS_SHIFT                 0                                      /**< Shift value for CPDMA_CHDIS                 */
#define _CPDMA_CHDIS_CHDIS_MASK                  0x7FFFFFFFUL                           /**< Bit mask for CPDMA_CHDIS                    */
#define _CPDMA_CHDIS_CHDIS_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for CPDMA_CHDIS                */
#define CPDMA_CHDIS_CHDIS_DEFAULT                (_CPDMA_CHDIS_CHDIS_DEFAULT << 0)      /**< Shifted mode DEFAULT for CPDMA_CHDIS        */

/* Bit fields for CPDMA CHSTATUS */
#define _CPDMA_CHSTATUS_RESETVALUE               0x00000000UL                            /**< Default value for CPDMA_CHSTATUS            */
#define _CPDMA_CHSTATUS_MASK                     0x7FFFFFFFUL                            /**< Mask for CPDMA_CHSTATUS                     */
#define _CPDMA_CHSTATUS_CHSTATUS_SHIFT           0                                       /**< Shift value for CPDMA_CHSTATUS              */
#define _CPDMA_CHSTATUS_CHSTATUS_MASK            0x7FFFFFFFUL                            /**< Bit mask for CPDMA_CHSTATUS                 */
#define _CPDMA_CHSTATUS_CHSTATUS_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for CPDMA_CHSTATUS             */
#define CPDMA_CHSTATUS_CHSTATUS_DEFAULT          (_CPDMA_CHSTATUS_CHSTATUS_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_CHSTATUS     */

