SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_cpdma.h
/* Bit fields for CPDMA CHBUSY */
#define _CPDMA_CHBUSY_RESETVALUE                 0x00000000UL                           /**< Default value for CPDMA_CHBUSY              */
#define _CPDMA_CHBUSY_MASK                       0x7FFFFFFFUL                           /**< Mask for CPDMA_CHBUSY                       */
#define _CPDMA_CHBUSY_BUSY_SHIFT                 0                                      /**< Shift value for CPDMA_BUSY                  */
#define _CPDMA_CHBUSY_BUSY_MASK                  0x7FFFFFFFUL                           /**< Bit mask for CPDMA_BUSY                     */
#define _CPDMA_CHBUSY_BUSY_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for CPDMA_CHBUSY               */
#define CPDMA_CHBUSY_BUSY_DEFAULT                (_CPDMA_CHBUSY_BUSY_DEFAULT << 0)      /**< Shifted mode DEFAULT for CPDMA_CHBUSY       */

/* Bit fields for CPDMA CHDONEIF */
#define _CPDMA_CHDONEIF_RESETVALUE               0x00000000UL                               /**< Default value for CPDMA_CHDONEIF            */
#define _CPDMA_CHDONEIF_MASK                     0x7FFFFFFFUL                               /**< Mask for CPDMA_CHDONEIF                     */
#define CPDMA_CHDONEIF_CHDONEIF0                 (0x1UL << 0)                               /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF0_SHIFT          0                                          /**< Shift value for CPDMA_CHDONEIF0             */
#define _CPDMA_CHDONEIF_CHDONEIF0_MASK           0x1UL                                      /**< Bit mask for CPDMA_CHDONEIF0                */
#define _CPDMA_CHDONEIF_CHDONEIF0_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF0_DEFAULT         (_CPDMA_CHDONEIF_CHDONEIF0_DEFAULT << 0)   /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF1                 (0x1UL << 1)                               /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF1_SHIFT          1                                          /**< Shift value for CPDMA_CHDONEIF1             */
#define _CPDMA_CHDONEIF_CHDONEIF1_MASK           0x2UL                                      /**< Bit mask for CPDMA_CHDONEIF1                */
#define _CPDMA_CHDONEIF_CHDONEIF1_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF1_DEFAULT         (_CPDMA_CHDONEIF_CHDONEIF1_DEFAULT << 1)   /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF2                 (0x1UL << 2)                               /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF2_SHIFT          2                                          /**< Shift value for CPDMA_CHDONEIF2             */
#define _CPDMA_CHDONEIF_CHDONEIF2_MASK           0x4UL                                      /**< Bit mask for CPDMA_CHDONEIF2                */
#define _CPDMA_CHDONEIF_CHDONEIF2_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF2_DEFAULT         (_CPDMA_CHDONEIF_CHDONEIF2_DEFAULT << 2)   /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF3                 (0x1UL << 3)                               /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF3_SHIFT          3                                          /**< Shift value for CPDMA_CHDONEIF3             */
#define _CPDMA_CHDONEIF_CHDONEIF3_MASK           0x8UL                                      /**< Bit mask for CPDMA_CHDONEIF3                */
#define _CPDMA_CHDONEIF_CHDONEIF3_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF3_DEFAULT         (_CPDMA_CHDONEIF_CHDONEIF3_DEFAULT << 3)   /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF4                 (0x1UL << 4)                               /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF4_SHIFT          4                                          /**< Shift value for CPDMA_CHDONEIF4             */
#define _CPDMA_CHDONEIF_CHDONEIF4_MASK           0x10UL                                     /**< Bit mask for CPDMA_CHDONEIF4                */
#define _CPDMA_CHDONEIF_CHDONEIF4_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF4_DEFAULT         (_CPDMA_CHDONEIF_CHDONEIF4_DEFAULT << 4)   /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF5                 (0x1UL << 5)                               /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF5_SHIFT          5                                          /**< Shift value for CPDMA_CHDONEIF5             */
#define _CPDMA_CHDONEIF_CHDONEIF5_MASK           0x20UL                                     /**< Bit mask for CPDMA_CHDONEIF5                */
#define _CPDMA_CHDONEIF_CHDONEIF5_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF5_DEFAULT         (_CPDMA_CHDONEIF_CHDONEIF5_DEFAULT << 5)   /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF6                 (0x1UL << 6)                               /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF6_SHIFT          6                                          /**< Shift value for CPDMA_CHDONEIF6             */
#define _CPDMA_CHDONEIF_CHDONEIF6_MASK           0x40UL                                     /**< Bit mask for CPDMA_CHDONEIF6                */
#define _CPDMA_CHDONEIF_CHDONEIF6_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF6_DEFAULT         (_CPDMA_CHDONEIF_CHDONEIF6_DEFAULT << 6)   /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF7                 (0x1UL << 7)                               /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF7_SHIFT          7                                          /**< Shift value for CPDMA_CHDONEIF7             */
#define _CPDMA_CHDONEIF_CHDONEIF7_MASK           0x80UL                                     /**< Bit mask for CPDMA_CHDONEIF7                */
#define _CPDMA_CHDONEIF_CHDONEIF7_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF7_DEFAULT         (_CPDMA_CHDONEIF_CHDONEIF7_DEFAULT << 7)   /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF8                 (0x1UL << 8)                               /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF8_SHIFT          8                                          /**< Shift value for CPDMA_CHDONEIF8             */
#define _CPDMA_CHDONEIF_CHDONEIF8_MASK           0x100UL                                    /**< Bit mask for CPDMA_CHDONEIF8                */
#define _CPDMA_CHDONEIF_CHDONEIF8_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF8_DEFAULT         (_CPDMA_CHDONEIF_CHDONEIF8_DEFAULT << 8)   /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF9                 (0x1UL << 9)                               /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF9_SHIFT          9                                          /**< Shift value for CPDMA_CHDONEIF9             */
#define _CPDMA_CHDONEIF_CHDONEIF9_MASK           0x200UL                                    /**< Bit mask for CPDMA_CHDONEIF9                */
#define _CPDMA_CHDONEIF_CHDONEIF9_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF9_DEFAULT         (_CPDMA_CHDONEIF_CHDONEIF9_DEFAULT << 9)   /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF10                (0x1UL << 10)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF10_SHIFT         10                                         /**< Shift value for CPDMA_CHDONEIF10            */
#define _CPDMA_CHDONEIF_CHDONEIF10_MASK          0x400UL                                    /**< Bit mask for CPDMA_CHDONEIF10               */
#define _CPDMA_CHDONEIF_CHDONEIF10_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF10_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF10_DEFAULT << 10) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF11                (0x1UL << 11)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF11_SHIFT         11                                         /**< Shift value for CPDMA_CHDONEIF11            */
#define _CPDMA_CHDONEIF_CHDONEIF11_MASK          0x800UL                                    /**< Bit mask for CPDMA_CHDONEIF11               */
#define _CPDMA_CHDONEIF_CHDONEIF11_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF11_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF11_DEFAULT << 11) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF12                (0x1UL << 12)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF12_SHIFT         12                                         /**< Shift value for CPDMA_CHDONEIF12            */
#define _CPDMA_CHDONEIF_CHDONEIF12_MASK          0x1000UL                                   /**< Bit mask for CPDMA_CHDONEIF12               */
#define _CPDMA_CHDONEIF_CHDONEIF12_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF12_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF12_DEFAULT << 12) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF13                (0x1UL << 13)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF13_SHIFT         13                                         /**< Shift value for CPDMA_CHDONEIF13            */
#define _CPDMA_CHDONEIF_CHDONEIF13_MASK          0x2000UL                                   /**< Bit mask for CPDMA_CHDONEIF13               */
#define _CPDMA_CHDONEIF_CHDONEIF13_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF13_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF13_DEFAULT << 13) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF14                (0x1UL << 14)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF14_SHIFT         14                                         /**< Shift value for CPDMA_CHDONEIF14            */
#define _CPDMA_CHDONEIF_CHDONEIF14_MASK          0x4000UL                                   /**< Bit mask for CPDMA_CHDONEIF14               */
#define _CPDMA_CHDONEIF_CHDONEIF14_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF14_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF14_DEFAULT << 14) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF15                (0x1UL << 15)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF15_SHIFT         15                                         /**< Shift value for CPDMA_CHDONEIF15            */
#define _CPDMA_CHDONEIF_CHDONEIF15_MASK          0x8000UL                                   /**< Bit mask for CPDMA_CHDONEIF15               */
#define _CPDMA_CHDONEIF_CHDONEIF15_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF15_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF15_DEFAULT << 15) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF16                (0x1UL << 16)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF16_SHIFT         16                                         /**< Shift value for CPDMA_CHDONEIF16            */
#define _CPDMA_CHDONEIF_CHDONEIF16_MASK          0x10000UL                                  /**< Bit mask for CPDMA_CHDONEIF16               */
#define _CPDMA_CHDONEIF_CHDONEIF16_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF16_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF16_DEFAULT << 16) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF17                (0x1UL << 17)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF17_SHIFT         17                                         /**< Shift value for CPDMA_CHDONEIF17            */
#define _CPDMA_CHDONEIF_CHDONEIF17_MASK          0x20000UL                                  /**< Bit mask for CPDMA_CHDONEIF17               */
#define _CPDMA_CHDONEIF_CHDONEIF17_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF17_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF17_DEFAULT << 17) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF18                (0x1UL << 18)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF18_SHIFT         18                                         /**< Shift value for CPDMA_CHDONEIF18            */
#define _CPDMA_CHDONEIF_CHDONEIF18_MASK          0x40000UL                                  /**< Bit mask for CPDMA_CHDONEIF18               */
#define _CPDMA_CHDONEIF_CHDONEIF18_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF18_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF18_DEFAULT << 18) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF19                (0x1UL << 19)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF19_SHIFT         19                                         /**< Shift value for CPDMA_CHDONEIF19            */
#define _CPDMA_CHDONEIF_CHDONEIF19_MASK          0x80000UL                                  /**< Bit mask for CPDMA_CHDONEIF19               */
#define _CPDMA_CHDONEIF_CHDONEIF19_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF19_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF19_DEFAULT << 19) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF20                (0x1UL << 20)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF20_SHIFT         20                                         /**< Shift value for CPDMA_CHDONEIF20            */
#define _CPDMA_CHDONEIF_CHDONEIF20_MASK          0x100000UL                                 /**< Bit mask for CPDMA_CHDONEIF20               */
#define _CPDMA_CHDONEIF_CHDONEIF20_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF20_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF20_DEFAULT << 20) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF21                (0x1UL << 21)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF21_SHIFT         21                                         /**< Shift value for CPDMA_CHDONEIF21            */
#define _CPDMA_CHDONEIF_CHDONEIF21_MASK          0x200000UL                                 /**< Bit mask for CPDMA_CHDONEIF21               */
#define _CPDMA_CHDONEIF_CHDONEIF21_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF21_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF21_DEFAULT << 21) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF22                (0x1UL << 22)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF22_SHIFT         22                                         /**< Shift value for CPDMA_CHDONEIF22            */
#define _CPDMA_CHDONEIF_CHDONEIF22_MASK          0x400000UL                                 /**< Bit mask for CPDMA_CHDONEIF22               */
#define _CPDMA_CHDONEIF_CHDONEIF22_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF22_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF22_DEFAULT << 22) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF23                (0x1UL << 23)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF23_SHIFT         23                                         /**< Shift value for CPDMA_CHDONEIF23            */
#define _CPDMA_CHDONEIF_CHDONEIF23_MASK          0x800000UL                                 /**< Bit mask for CPDMA_CHDONEIF23               */
#define _CPDMA_CHDONEIF_CHDONEIF23_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF23_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF23_DEFAULT << 23) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF24                (0x1UL << 24)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF24_SHIFT         24                                         /**< Shift value for CPDMA_CHDONEIF24            */
#define _CPDMA_CHDONEIF_CHDONEIF24_MASK          0x1000000UL                                /**< Bit mask for CPDMA_CHDONEIF24               */
#define _CPDMA_CHDONEIF_CHDONEIF24_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF24_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF24_DEFAULT << 24) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF25                (0x1UL << 25)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF25_SHIFT         25                                         /**< Shift value for CPDMA_CHDONEIF25            */
#define _CPDMA_CHDONEIF_CHDONEIF25_MASK          0x2000000UL                                /**< Bit mask for CPDMA_CHDONEIF25               */
#define _CPDMA_CHDONEIF_CHDONEIF25_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF25_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF25_DEFAULT << 25) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF26                (0x1UL << 26)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF26_SHIFT         26                                         /**< Shift value for CPDMA_CHDONEIF26            */
#define _CPDMA_CHDONEIF_CHDONEIF26_MASK          0x4000000UL                                /**< Bit mask for CPDMA_CHDONEIF26               */
#define _CPDMA_CHDONEIF_CHDONEIF26_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF26_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF26_DEFAULT << 26) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF27                (0x1UL << 27)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF27_SHIFT         27                                         /**< Shift value for CPDMA_CHDONEIF27            */
#define _CPDMA_CHDONEIF_CHDONEIF27_MASK          0x8000000UL                                /**< Bit mask for CPDMA_CHDONEIF27               */
#define _CPDMA_CHDONEIF_CHDONEIF27_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF27_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF27_DEFAULT << 27) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF28                (0x1UL << 28)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF28_SHIFT         28                                         /**< Shift value for CPDMA_CHDONEIF28            */
#define _CPDMA_CHDONEIF_CHDONEIF28_MASK          0x10000000UL                               /**< Bit mask for CPDMA_CHDONEIF28               */
#define _CPDMA_CHDONEIF_CHDONEIF28_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF28_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF28_DEFAULT << 28) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF29                (0x1UL << 29)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF29_SHIFT         29                                         /**< Shift value for CPDMA_CHDONEIF29            */
#define _CPDMA_CHDONEIF_CHDONEIF29_MASK          0x20000000UL                               /**< Bit mask for CPDMA_CHDONEIF29               */
#define _CPDMA_CHDONEIF_CHDONEIF29_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF29_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF29_DEFAULT << 29) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */
#define CPDMA_CHDONEIF_CHDONEIF30                (0x1UL << 30)                              /**< Channel Done Flag                           */
#define _CPDMA_CHDONEIF_CHDONEIF30_SHIFT         30                                         /**< Shift value for CPDMA_CHDONEIF30            */
#define _CPDMA_CHDONEIF_CHDONEIF30_MASK          0x40000000UL                               /**< Bit mask for CPDMA_CHDONEIF30               */
#define _CPDMA_CHDONEIF_CHDONEIF30_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CPDMA_CHDONEIF             */
#define CPDMA_CHDONEIF_CHDONEIF30_DEFAULT        (_CPDMA_CHDONEIF_CHDONEIF30_DEFAULT << 30) /**< Shifted mode DEFAULT for CPDMA_CHDONEIF     */

