SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_cpdma.h
/* Bit fields for CPDMA DBGHALT */
#define _CPDMA_DBGHALT_RESETVALUE                0x00000000UL                           /**< Default value for CPDMA_DBGHALT             */
#define _CPDMA_DBGHALT_MASK                      0x7FFFFFFFUL                           /**< Mask for CPDMA_DBGHALT                      */
#define _CPDMA_DBGHALT_DBGHALT_SHIFT             0                                      /**< Shift value for CPDMA_DBGHALT               */
#define _CPDMA_DBGHALT_DBGHALT_MASK              0x7FFFFFFFUL                           /**< Bit mask for CPDMA_DBGHALT                  */
#define _CPDMA_DBGHALT_DBGHALT_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for CPDMA_DBGHALT              */
#define CPDMA_DBGHALT_DBGHALT_DEFAULT            (_CPDMA_DBGHALT_DBGHALT_DEFAULT << 0)  /**< Shifted mode DEFAULT for CPDMA_DBGHALT      */

/* Bit fields for CPDMA SWREQ */
#define _CPDMA_SWREQ_RESETVALUE                  0x00000000UL                           /**< Default value for CPDMA_SWREQ               */
#define _CPDMA_SWREQ_MASK                        0x7FFFFFFFUL                           /**< Mask for CPDMA_SWREQ                        */
#define _CPDMA_SWREQ_SWREQ_SHIFT                 0                                      /**< Shift value for CPDMA_SWREQ                 */
#define _CPDMA_SWREQ_SWREQ_MASK                  0x7FFFFFFFUL                           /**< Bit mask for CPDMA_SWREQ                    */
#define _CPDMA_SWREQ_SWREQ_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for CPDMA_SWREQ                */
#define CPDMA_SWREQ_SWREQ_DEFAULT                (_CPDMA_SWREQ_SWREQ_DEFAULT << 0)      /**< Shifted mode DEFAULT for CPDMA_SWREQ        */

/* Bit fields for CPDMA REQDIS */
#define _CPDMA_REQDIS_RESETVALUE                 0x00000000UL                           /**< Default value for CPDMA_REQDIS              */
#define _CPDMA_REQDIS_MASK                       0x7FFFFFFFUL                           /**< Mask for CPDMA_REQDIS                       */
#define _CPDMA_REQDIS_REQDIS_SHIFT               0                                      /**< Shift value for CPDMA_REQDIS                */
#define _CPDMA_REQDIS_REQDIS_MASK                0x7FFFFFFFUL                           /**< Bit mask for CPDMA_REQDIS                   */
#define _CPDMA_REQDIS_REQDIS_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for CPDMA_REQDIS               */
#define CPDMA_REQDIS_REQDIS_DEFAULT              (_CPDMA_REQDIS_REQDIS_DEFAULT << 0)    /**< Shifted mode DEFAULT for CPDMA_REQDIS       */

/* Bit fields for CPDMA REQPEND */
#define _CPDMA_REQPEND_RESETVALUE                0x00000000UL                           /**< Default value for CPDMA_REQPEND             */
#define _CPDMA_REQPEND_MASK                      0x7FFFFFFFUL                           /**< Mask for CPDMA_REQPEND                      */
#define _CPDMA_REQPEND_REQPEND_SHIFT             0                                      /**< Shift value for CPDMA_REQPEND               */
#define _CPDMA_REQPEND_REQPEND_MASK              0x7FFFFFFFUL                           /**< Bit mask for CPDMA_REQPEND                  */
#define _CPDMA_REQPEND_REQPEND_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for CPDMA_REQPEND              */
#define CPDMA_REQPEND_REQPEND_DEFAULT            (_CPDMA_REQPEND_REQPEND_DEFAULT << 0)  /**< Shifted mode DEFAULT for CPDMA_REQPEND      */

/* Bit fields for CPDMA REQCLEAR */
#define _CPDMA_REQCLEAR_RESETVALUE               0x00000000UL                            /**< Default value for CPDMA_REQCLEAR            */
#define _CPDMA_REQCLEAR_MASK                     0x7FFFFFFFUL                            /**< Mask for CPDMA_REQCLEAR                     */
#define _CPDMA_REQCLEAR_REQCLEAR_SHIFT           0                                       /**< Shift value for CPDMA_REQCLEAR              */
#define _CPDMA_REQCLEAR_REQCLEAR_MASK            0x7FFFFFFFUL                            /**< Bit mask for CPDMA_REQCLEAR                 */
#define _CPDMA_REQCLEAR_REQCLEAR_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for CPDMA_REQCLEAR             */
#define CPDMA_REQCLEAR_REQCLEAR_DEFAULT          (_CPDMA_REQCLEAR_REQCLEAR_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_REQCLEAR     */

/* Bit fields for CPDMA FIFORST */
#define _CPDMA_FIFORST_RESETVALUE                0x00000000UL                           /**< Default value for CPDMA_FIFORST             */
#define _CPDMA_FIFORST_MASK                      0x7FFFFFFFUL                           /**< Mask for CPDMA_FIFORST                      */
#define _CPDMA_FIFORST_FIFORST_SHIFT             0                                      /**< Shift value for CPDMA_FIFORST               */
#define _CPDMA_FIFORST_FIFORST_MASK              0x7FFFFFFFUL                           /**< Bit mask for CPDMA_FIFORST                  */
#define _CPDMA_FIFORST_FIFORST_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for CPDMA_FIFORST              */
#define CPDMA_FIFORST_FIFORST_DEFAULT            (_CPDMA_FIFORST_FIFORST_DEFAULT << 0)  /**< Shifted mode DEFAULT for CPDMA_FIFORST      */

/* Bit fields for CPDMA IF */
#define _CPDMA_IF_RESETVALUE                     0x00000000UL                           /**< Default value for CPDMA_IF                  */
#define _CPDMA_IF_MASK                           0xFFFFFFFFUL                           /**< Mask for CPDMA_IF                           */
#define CPDMA_IF_DONE0                           (0x1UL << 0)                           /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE0_SHIFT                    0                                      /**< Shift value for CPDMA_DONE0                 */
#define _CPDMA_IF_DONE0_MASK                     0x1UL                                  /**< Bit mask for CPDMA_DONE0                    */
#define _CPDMA_IF_DONE0_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE0_DEFAULT                   (_CPDMA_IF_DONE0_DEFAULT << 0)         /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE1                           (0x1UL << 1)                           /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE1_SHIFT                    1                                      /**< Shift value for CPDMA_DONE1                 */
#define _CPDMA_IF_DONE1_MASK                     0x2UL                                  /**< Bit mask for CPDMA_DONE1                    */
#define _CPDMA_IF_DONE1_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE1_DEFAULT                   (_CPDMA_IF_DONE1_DEFAULT << 1)         /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE2                           (0x1UL << 2)                           /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE2_SHIFT                    2                                      /**< Shift value for CPDMA_DONE2                 */
#define _CPDMA_IF_DONE2_MASK                     0x4UL                                  /**< Bit mask for CPDMA_DONE2                    */
#define _CPDMA_IF_DONE2_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE2_DEFAULT                   (_CPDMA_IF_DONE2_DEFAULT << 2)         /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE3                           (0x1UL << 3)                           /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE3_SHIFT                    3                                      /**< Shift value for CPDMA_DONE3                 */
#define _CPDMA_IF_DONE3_MASK                     0x8UL                                  /**< Bit mask for CPDMA_DONE3                    */
#define _CPDMA_IF_DONE3_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE3_DEFAULT                   (_CPDMA_IF_DONE3_DEFAULT << 3)         /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE4                           (0x1UL << 4)                           /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE4_SHIFT                    4                                      /**< Shift value for CPDMA_DONE4                 */
#define _CPDMA_IF_DONE4_MASK                     0x10UL                                 /**< Bit mask for CPDMA_DONE4                    */
#define _CPDMA_IF_DONE4_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE4_DEFAULT                   (_CPDMA_IF_DONE4_DEFAULT << 4)         /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE5                           (0x1UL << 5)                           /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE5_SHIFT                    5                                      /**< Shift value for CPDMA_DONE5                 */
#define _CPDMA_IF_DONE5_MASK                     0x20UL                                 /**< Bit mask for CPDMA_DONE5                    */
#define _CPDMA_IF_DONE5_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE5_DEFAULT                   (_CPDMA_IF_DONE5_DEFAULT << 5)         /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE6                           (0x1UL << 6)                           /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE6_SHIFT                    6                                      /**< Shift value for CPDMA_DONE6                 */
#define _CPDMA_IF_DONE6_MASK                     0x40UL                                 /**< Bit mask for CPDMA_DONE6                    */
#define _CPDMA_IF_DONE6_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE6_DEFAULT                   (_CPDMA_IF_DONE6_DEFAULT << 6)         /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE7                           (0x1UL << 7)                           /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE7_SHIFT                    7                                      /**< Shift value for CPDMA_DONE7                 */
#define _CPDMA_IF_DONE7_MASK                     0x80UL                                 /**< Bit mask for CPDMA_DONE7                    */
#define _CPDMA_IF_DONE7_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE7_DEFAULT                   (_CPDMA_IF_DONE7_DEFAULT << 7)         /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE8                           (0x1UL << 8)                           /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE8_SHIFT                    8                                      /**< Shift value for CPDMA_DONE8                 */
#define _CPDMA_IF_DONE8_MASK                     0x100UL                                /**< Bit mask for CPDMA_DONE8                    */
#define _CPDMA_IF_DONE8_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE8_DEFAULT                   (_CPDMA_IF_DONE8_DEFAULT << 8)         /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE9                           (0x1UL << 9)                           /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE9_SHIFT                    9                                      /**< Shift value for CPDMA_DONE9                 */
#define _CPDMA_IF_DONE9_MASK                     0x200UL                                /**< Bit mask for CPDMA_DONE9                    */
#define _CPDMA_IF_DONE9_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE9_DEFAULT                   (_CPDMA_IF_DONE9_DEFAULT << 9)         /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE10                          (0x1UL << 10)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE10_SHIFT                   10                                     /**< Shift value for CPDMA_DONE10                */
#define _CPDMA_IF_DONE10_MASK                    0x400UL                                /**< Bit mask for CPDMA_DONE10                   */
#define _CPDMA_IF_DONE10_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE10_DEFAULT                  (_CPDMA_IF_DONE10_DEFAULT << 10)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE11                          (0x1UL << 11)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE11_SHIFT                   11                                     /**< Shift value for CPDMA_DONE11                */
#define _CPDMA_IF_DONE11_MASK                    0x800UL                                /**< Bit mask for CPDMA_DONE11                   */
#define _CPDMA_IF_DONE11_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE11_DEFAULT                  (_CPDMA_IF_DONE11_DEFAULT << 11)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE12                          (0x1UL << 12)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE12_SHIFT                   12                                     /**< Shift value for CPDMA_DONE12                */
#define _CPDMA_IF_DONE12_MASK                    0x1000UL                               /**< Bit mask for CPDMA_DONE12                   */
#define _CPDMA_IF_DONE12_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE12_DEFAULT                  (_CPDMA_IF_DONE12_DEFAULT << 12)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE13                          (0x1UL << 13)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE13_SHIFT                   13                                     /**< Shift value for CPDMA_DONE13                */
#define _CPDMA_IF_DONE13_MASK                    0x2000UL                               /**< Bit mask for CPDMA_DONE13                   */
#define _CPDMA_IF_DONE13_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE13_DEFAULT                  (_CPDMA_IF_DONE13_DEFAULT << 13)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE14                          (0x1UL << 14)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE14_SHIFT                   14                                     /**< Shift value for CPDMA_DONE14                */
#define _CPDMA_IF_DONE14_MASK                    0x4000UL                               /**< Bit mask for CPDMA_DONE14                   */
#define _CPDMA_IF_DONE14_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE14_DEFAULT                  (_CPDMA_IF_DONE14_DEFAULT << 14)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE15                          (0x1UL << 15)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE15_SHIFT                   15                                     /**< Shift value for CPDMA_DONE15                */
#define _CPDMA_IF_DONE15_MASK                    0x8000UL                               /**< Bit mask for CPDMA_DONE15                   */
#define _CPDMA_IF_DONE15_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE15_DEFAULT                  (_CPDMA_IF_DONE15_DEFAULT << 15)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE16                          (0x1UL << 16)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE16_SHIFT                   16                                     /**< Shift value for CPDMA_DONE16                */
#define _CPDMA_IF_DONE16_MASK                    0x10000UL                              /**< Bit mask for CPDMA_DONE16                   */
#define _CPDMA_IF_DONE16_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE16_DEFAULT                  (_CPDMA_IF_DONE16_DEFAULT << 16)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE17                          (0x1UL << 17)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE17_SHIFT                   17                                     /**< Shift value for CPDMA_DONE17                */
#define _CPDMA_IF_DONE17_MASK                    0x20000UL                              /**< Bit mask for CPDMA_DONE17                   */
#define _CPDMA_IF_DONE17_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE17_DEFAULT                  (_CPDMA_IF_DONE17_DEFAULT << 17)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE18                          (0x1UL << 18)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE18_SHIFT                   18                                     /**< Shift value for CPDMA_DONE18                */
#define _CPDMA_IF_DONE18_MASK                    0x40000UL                              /**< Bit mask for CPDMA_DONE18                   */
#define _CPDMA_IF_DONE18_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE18_DEFAULT                  (_CPDMA_IF_DONE18_DEFAULT << 18)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE19                          (0x1UL << 19)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE19_SHIFT                   19                                     /**< Shift value for CPDMA_DONE19                */
#define _CPDMA_IF_DONE19_MASK                    0x80000UL                              /**< Bit mask for CPDMA_DONE19                   */
#define _CPDMA_IF_DONE19_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE19_DEFAULT                  (_CPDMA_IF_DONE19_DEFAULT << 19)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE20                          (0x1UL << 20)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE20_SHIFT                   20                                     /**< Shift value for CPDMA_DONE20                */
#define _CPDMA_IF_DONE20_MASK                    0x100000UL                             /**< Bit mask for CPDMA_DONE20                   */
#define _CPDMA_IF_DONE20_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE20_DEFAULT                  (_CPDMA_IF_DONE20_DEFAULT << 20)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE21                          (0x1UL << 21)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE21_SHIFT                   21                                     /**< Shift value for CPDMA_DONE21                */
#define _CPDMA_IF_DONE21_MASK                    0x200000UL                             /**< Bit mask for CPDMA_DONE21                   */
#define _CPDMA_IF_DONE21_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE21_DEFAULT                  (_CPDMA_IF_DONE21_DEFAULT << 21)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE22                          (0x1UL << 22)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE22_SHIFT                   22                                     /**< Shift value for CPDMA_DONE22                */
#define _CPDMA_IF_DONE22_MASK                    0x400000UL                             /**< Bit mask for CPDMA_DONE22                   */
#define _CPDMA_IF_DONE22_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE22_DEFAULT                  (_CPDMA_IF_DONE22_DEFAULT << 22)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE23                          (0x1UL << 23)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE23_SHIFT                   23                                     /**< Shift value for CPDMA_DONE23                */
#define _CPDMA_IF_DONE23_MASK                    0x800000UL                             /**< Bit mask for CPDMA_DONE23                   */
#define _CPDMA_IF_DONE23_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE23_DEFAULT                  (_CPDMA_IF_DONE23_DEFAULT << 23)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE24                          (0x1UL << 24)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE24_SHIFT                   24                                     /**< Shift value for CPDMA_DONE24                */
#define _CPDMA_IF_DONE24_MASK                    0x1000000UL                            /**< Bit mask for CPDMA_DONE24                   */
#define _CPDMA_IF_DONE24_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE24_DEFAULT                  (_CPDMA_IF_DONE24_DEFAULT << 24)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE25                          (0x1UL << 25)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE25_SHIFT                   25                                     /**< Shift value for CPDMA_DONE25                */
#define _CPDMA_IF_DONE25_MASK                    0x2000000UL                            /**< Bit mask for CPDMA_DONE25                   */
#define _CPDMA_IF_DONE25_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE25_DEFAULT                  (_CPDMA_IF_DONE25_DEFAULT << 25)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE26                          (0x1UL << 26)                          /**< Channel Done Interrupt Flag                 */
