SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_cpdma.h
#define _CPDMA_IF_DONE26_SHIFT                   26                                     /**< Shift value for CPDMA_DONE26                */
#define _CPDMA_IF_DONE26_MASK                    0x4000000UL                            /**< Bit mask for CPDMA_DONE26                   */
#define _CPDMA_IF_DONE26_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE26_DEFAULT                  (_CPDMA_IF_DONE26_DEFAULT << 26)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE27                          (0x1UL << 27)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE27_SHIFT                   27                                     /**< Shift value for CPDMA_DONE27                */
#define _CPDMA_IF_DONE27_MASK                    0x8000000UL                            /**< Bit mask for CPDMA_DONE27                   */
#define _CPDMA_IF_DONE27_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE27_DEFAULT                  (_CPDMA_IF_DONE27_DEFAULT << 27)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE28                          (0x1UL << 28)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE28_SHIFT                   28                                     /**< Shift value for CPDMA_DONE28                */
#define _CPDMA_IF_DONE28_MASK                    0x10000000UL                           /**< Bit mask for CPDMA_DONE28                   */
#define _CPDMA_IF_DONE28_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE28_DEFAULT                  (_CPDMA_IF_DONE28_DEFAULT << 28)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE29                          (0x1UL << 29)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE29_SHIFT                   29                                     /**< Shift value for CPDMA_DONE29                */
#define _CPDMA_IF_DONE29_MASK                    0x20000000UL                           /**< Bit mask for CPDMA_DONE29                   */
#define _CPDMA_IF_DONE29_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE29_DEFAULT                  (_CPDMA_IF_DONE29_DEFAULT << 29)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_DONE30                          (0x1UL << 30)                          /**< Channel Done Interrupt Flag                 */
#define _CPDMA_IF_DONE30_SHIFT                   30                                     /**< Shift value for CPDMA_DONE30                */
#define _CPDMA_IF_DONE30_MASK                    0x40000000UL                           /**< Bit mask for CPDMA_DONE30                   */
#define _CPDMA_IF_DONE30_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_DONE30_DEFAULT                  (_CPDMA_IF_DONE30_DEFAULT << 30)       /**< Shifted mode DEFAULT for CPDMA_IF           */
#define CPDMA_IF_ERROR                           (0x1UL << 31)                          /**< Bus Error Interrupt Flag                    */
#define _CPDMA_IF_ERROR_SHIFT                    31                                     /**< Shift value for CPDMA_ERROR                 */
#define _CPDMA_IF_ERROR_MASK                     0x80000000UL                           /**< Bit mask for CPDMA_ERROR                    */
#define _CPDMA_IF_ERROR_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for CPDMA_IF                   */
#define CPDMA_IF_ERROR_DEFAULT                   (_CPDMA_IF_ERROR_DEFAULT << 31)        /**< Shifted mode DEFAULT for CPDMA_IF           */

/* Bit fields for CPDMA IEN */
#define _CPDMA_IEN_RESETVALUE                    0x00000000UL                           /**< Default value for CPDMA_IEN                 */
#define _CPDMA_IEN_MASK                          0xFFFFFFFFUL                           /**< Mask for CPDMA_IEN                          */
#define _CPDMA_IEN_CHDONE_SHIFT                  0                                      /**< Shift value for CPDMA_CHDONE                */
#define _CPDMA_IEN_CHDONE_MASK                   0x7FFFFFFFUL                           /**< Bit mask for CPDMA_CHDONE                   */
#define _CPDMA_IEN_CHDONE_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for CPDMA_IEN                  */
#define CPDMA_IEN_CHDONE_DEFAULT                 (_CPDMA_IEN_CHDONE_DEFAULT << 0)       /**< Shifted mode DEFAULT for CPDMA_IEN          */
#define CPDMA_IEN_ERROR                          (0x1UL << 31)                          /**< Bus Error Int Enable                        */
#define _CPDMA_IEN_ERROR_SHIFT                   31                                     /**< Shift value for CPDMA_ERROR                 */
#define _CPDMA_IEN_ERROR_MASK                    0x80000000UL                           /**< Bit mask for CPDMA_ERROR                    */
#define _CPDMA_IEN_ERROR_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CPDMA_IEN                  */
#define CPDMA_IEN_ERROR_DEFAULT                  (_CPDMA_IEN_ERROR_DEFAULT << 31)       /**< Shifted mode DEFAULT for CPDMA_IEN          */

/* Bit fields for CPDMA ADDRMSKEN1 */
#define _CPDMA_ADDRMSKEN1_RESETVALUE             0x00000000UL                           /**< Default value for CPDMA_ADDRMSKEN1          */
#define _CPDMA_ADDRMSKEN1_MASK                   0x7FFFFFFFUL                           /**< Mask for CPDMA_ADDRMSKEN1                   */
#define _CPDMA_ADDRMSKEN1_MSKEN_SHIFT            0                                      /**< Shift value for CPDMA_MSKEN                 */
#define _CPDMA_ADDRMSKEN1_MSKEN_MASK             0x7FFFFFFFUL                           /**< Bit mask for CPDMA_MSKEN                    */
#define _CPDMA_ADDRMSKEN1_MSKEN_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for CPDMA_ADDRMSKEN1           */
#define CPDMA_ADDRMSKEN1_MSKEN_DEFAULT           (_CPDMA_ADDRMSKEN1_MSKEN_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_ADDRMSKEN1   */

/* Bit fields for CPDMA ADDRMSKEN2 */
#define _CPDMA_ADDRMSKEN2_RESETVALUE             0x00000000UL                           /**< Default value for CPDMA_ADDRMSKEN2          */
#define _CPDMA_ADDRMSKEN2_MASK                   0x7FFFFFFFUL                           /**< Mask for CPDMA_ADDRMSKEN2                   */
#define _CPDMA_ADDRMSKEN2_MSKEN_SHIFT            0                                      /**< Shift value for CPDMA_MSKEN                 */
#define _CPDMA_ADDRMSKEN2_MSKEN_MASK             0x7FFFFFFFUL                           /**< Bit mask for CPDMA_MSKEN                    */
#define _CPDMA_ADDRMSKEN2_MSKEN_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for CPDMA_ADDRMSKEN2           */
#define CPDMA_ADDRMSKEN2_MSKEN_DEFAULT           (_CPDMA_ADDRMSKEN2_MSKEN_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_ADDRMSKEN2   */

/* Bit fields for CPDMA ADDRMSKEN3 */
#define _CPDMA_ADDRMSKEN3_RESETVALUE             0x00000000UL                           /**< Default value for CPDMA_ADDRMSKEN3          */
#define _CPDMA_ADDRMSKEN3_MASK                   0x7FFFFFFFUL                           /**< Mask for CPDMA_ADDRMSKEN3                   */
#define _CPDMA_ADDRMSKEN3_MSKEN_SHIFT            0                                      /**< Shift value for CPDMA_MSKEN                 */
#define _CPDMA_ADDRMSKEN3_MSKEN_MASK             0x7FFFFFFFUL                           /**< Bit mask for CPDMA_MSKEN                    */
#define _CPDMA_ADDRMSKEN3_MSKEN_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for CPDMA_ADDRMSKEN3           */
#define CPDMA_ADDRMSKEN3_MSKEN_DEFAULT           (_CPDMA_ADDRMSKEN3_MSKEN_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_ADDRMSKEN3   */

/* Bit fields for CPDMA ADDRMSKEN4 */
#define _CPDMA_ADDRMSKEN4_RESETVALUE             0x00000000UL                           /**< Default value for CPDMA_ADDRMSKEN4          */
#define _CPDMA_ADDRMSKEN4_MASK                   0x7FFFFFFFUL                           /**< Mask for CPDMA_ADDRMSKEN4                   */
#define _CPDMA_ADDRMSKEN4_MSKEN_SHIFT            0                                      /**< Shift value for CPDMA_MSKEN                 */
#define _CPDMA_ADDRMSKEN4_MSKEN_MASK             0x7FFFFFFFUL                           /**< Bit mask for CPDMA_MSKEN                    */
#define _CPDMA_ADDRMSKEN4_MSKEN_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for CPDMA_ADDRMSKEN4           */
#define CPDMA_ADDRMSKEN4_MSKEN_DEFAULT           (_CPDMA_ADDRMSKEN4_MSKEN_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_ADDRMSKEN4   */

