SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_cpdma.h
/* Bit fields for CPDMA ADDRMSK */
#define _CPDMA_ADDRMSK_RESETVALUE                0x00000000UL                           /**< Default value for CPDMA_ADDRMSK             */
#define _CPDMA_ADDRMSK_MASK                      0x1F1F1F1FUL                           /**< Mask for CPDMA_ADDRMSK                      */
#define _CPDMA_ADDRMSK_ADDMSK1_SHIFT             0                                      /**< Shift value for CPDMA_ADDMSK1               */
#define _CPDMA_ADDRMSK_ADDMSK1_MASK              0x1FUL                                 /**< Bit mask for CPDMA_ADDMSK1                  */
#define _CPDMA_ADDRMSK_ADDMSK1_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for CPDMA_ADDRMSK              */
#define CPDMA_ADDRMSK_ADDMSK1_DEFAULT            (_CPDMA_ADDRMSK_ADDMSK1_DEFAULT << 0)  /**< Shifted mode DEFAULT for CPDMA_ADDRMSK      */
#define _CPDMA_ADDRMSK_ADDMSK2_SHIFT             8                                      /**< Shift value for CPDMA_ADDMSK2               */
#define _CPDMA_ADDRMSK_ADDMSK2_MASK              0x1F00UL                               /**< Bit mask for CPDMA_ADDMSK2                  */
#define _CPDMA_ADDRMSK_ADDMSK2_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for CPDMA_ADDRMSK              */
#define CPDMA_ADDRMSK_ADDMSK2_DEFAULT            (_CPDMA_ADDRMSK_ADDMSK2_DEFAULT << 8)  /**< Shifted mode DEFAULT for CPDMA_ADDRMSK      */
#define _CPDMA_ADDRMSK_ADDMSK3_SHIFT             16                                     /**< Shift value for CPDMA_ADDMSK3               */
#define _CPDMA_ADDRMSK_ADDMSK3_MASK              0x1F0000UL                             /**< Bit mask for CPDMA_ADDMSK3                  */
#define _CPDMA_ADDRMSK_ADDMSK3_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for CPDMA_ADDRMSK              */
#define CPDMA_ADDRMSK_ADDMSK3_DEFAULT            (_CPDMA_ADDRMSK_ADDMSK3_DEFAULT << 16) /**< Shifted mode DEFAULT for CPDMA_ADDRMSK      */
#define _CPDMA_ADDRMSK_ADDMSK4_SHIFT             24                                     /**< Shift value for CPDMA_ADDMSK4               */
#define _CPDMA_ADDRMSK_ADDMSK4_MASK              0x1F000000UL                           /**< Bit mask for CPDMA_ADDMSK4                  */
#define _CPDMA_ADDRMSK_ADDMSK4_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for CPDMA_ADDRMSK              */
#define CPDMA_ADDRMSK_ADDMSK4_DEFAULT            (_CPDMA_ADDRMSK_ADDMSK4_DEFAULT << 24) /**< Shifted mode DEFAULT for CPDMA_ADDRMSK      */

/* Bit fields for CPDMA SYNCUPMSK1 */
#define _CPDMA_SYNCUPMSK1_RESETVALUE             0x00000000UL                                /**< Default value for CPDMA_SYNCUPMSK1          */
#define _CPDMA_SYNCUPMSK1_MASK                   0x7FFFFFFFUL                                /**< Mask for CPDMA_SYNCUPMSK1                   */
#define _CPDMA_SYNCUPMSK1_SYNCUPMSK1_SHIFT       0                                           /**< Shift value for CPDMA_SYNCUPMSK1            */
#define _CPDMA_SYNCUPMSK1_SYNCUPMSK1_MASK        0x7FFFFFFFUL                                /**< Bit mask for CPDMA_SYNCUPMSK1               */
#define _CPDMA_SYNCUPMSK1_SYNCUPMSK1_DEFAULT     0x00000000UL                                /**< Mode DEFAULT for CPDMA_SYNCUPMSK1           */
#define CPDMA_SYNCUPMSK1_SYNCUPMSK1_DEFAULT      (_CPDMA_SYNCUPMSK1_SYNCUPMSK1_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_SYNCUPMSK1   */

/* Bit fields for CPDMA SYNCUPMSK2 */
#define _CPDMA_SYNCUPMSK2_RESETVALUE             0x00000000UL                                /**< Default value for CPDMA_SYNCUPMSK2          */
#define _CPDMA_SYNCUPMSK2_MASK                   0x7FFFFFFFUL                                /**< Mask for CPDMA_SYNCUPMSK2                   */
#define _CPDMA_SYNCUPMSK2_SYNCUPMSK2_SHIFT       0                                           /**< Shift value for CPDMA_SYNCUPMSK2            */
#define _CPDMA_SYNCUPMSK2_SYNCUPMSK2_MASK        0x7FFFFFFFUL                                /**< Bit mask for CPDMA_SYNCUPMSK2               */
#define _CPDMA_SYNCUPMSK2_SYNCUPMSK2_DEFAULT     0x00000000UL                                /**< Mode DEFAULT for CPDMA_SYNCUPMSK2           */
#define CPDMA_SYNCUPMSK2_SYNCUPMSK2_DEFAULT      (_CPDMA_SYNCUPMSK2_SYNCUPMSK2_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_SYNCUPMSK2   */

/* Bit fields for CPDMA SYNCENAB1 */
#define _CPDMA_SYNCENAB1_RESETVALUE              0x00000000UL                              /**< Default value for CPDMA_SYNCENAB1           */
#define _CPDMA_SYNCENAB1_MASK                    0x7FFFFFFFUL                              /**< Mask for CPDMA_SYNCENAB1                    */
#define _CPDMA_SYNCENAB1_SYNCENAB1_SHIFT         0                                         /**< Shift value for CPDMA_SYNCENAB1             */
#define _CPDMA_SYNCENAB1_SYNCENAB1_MASK          0x7FFFFFFFUL                              /**< Bit mask for CPDMA_SYNCENAB1                */
#define _CPDMA_SYNCENAB1_SYNCENAB1_DEFAULT       0x00000000UL                              /**< Mode DEFAULT for CPDMA_SYNCENAB1            */
#define CPDMA_SYNCENAB1_SYNCENAB1_DEFAULT        (_CPDMA_SYNCENAB1_SYNCENAB1_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_SYNCENAB1    */

/* Bit fields for CPDMA SYNCENAB2 */
#define _CPDMA_SYNCENAB2_RESETVALUE              0x00000000UL                              /**< Default value for CPDMA_SYNCENAB2           */
#define _CPDMA_SYNCENAB2_MASK                    0x7FFFFFFFUL                              /**< Mask for CPDMA_SYNCENAB2                    */
#define _CPDMA_SYNCENAB2_SYNCENAB2_SHIFT         0                                         /**< Shift value for CPDMA_SYNCENAB2             */
#define _CPDMA_SYNCENAB2_SYNCENAB2_MASK          0x7FFFFFFFUL                              /**< Bit mask for CPDMA_SYNCENAB2                */
#define _CPDMA_SYNCENAB2_SYNCENAB2_DEFAULT       0x00000000UL                              /**< Mode DEFAULT for CPDMA_SYNCENAB2            */
#define CPDMA_SYNCENAB2_SYNCENAB2_DEFAULT        (_CPDMA_SYNCENAB2_SYNCENAB2_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_SYNCENAB2    */

