SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_cpdma.h
/* Bit fields for CPDMA SYNCINPTHRES */
#define _CPDMA_SYNCINPTHRES_RESETVALUE           0x00000101UL                                 /**< Default value for CPDMA_SYNCINPTHRES        */
#define _CPDMA_SYNCINPTHRES_MASK                 0x0000FFFFUL                                 /**< Mask for CPDMA_SYNCINPTHRES                 */
#define _CPDMA_SYNCINPTHRES_INPTHRES1_SHIFT      0                                            /**< Shift value for CPDMA_INPTHRES1             */
#define _CPDMA_SYNCINPTHRES_INPTHRES1_MASK       0xFFUL                                       /**< Bit mask for CPDMA_INPTHRES1                */
#define _CPDMA_SYNCINPTHRES_INPTHRES1_DEFAULT    0x00000001UL                                 /**< Mode DEFAULT for CPDMA_SYNCINPTHRES         */
#define CPDMA_SYNCINPTHRES_INPTHRES1_DEFAULT     (_CPDMA_SYNCINPTHRES_INPTHRES1_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_SYNCINPTHRES */
#define _CPDMA_SYNCINPTHRES_INPTHRES2_SHIFT      8                                            /**< Shift value for CPDMA_INPTHRES2             */
#define _CPDMA_SYNCINPTHRES_INPTHRES2_MASK       0xFF00UL                                     /**< Bit mask for CPDMA_INPTHRES2                */
#define _CPDMA_SYNCINPTHRES_INPTHRES2_DEFAULT    0x00000001UL                                 /**< Mode DEFAULT for CPDMA_SYNCINPTHRES         */
#define CPDMA_SYNCINPTHRES_INPTHRES2_DEFAULT     (_CPDMA_SYNCINPTHRES_INPTHRES2_DEFAULT << 8) /**< Shifted mode DEFAULT for CPDMA_SYNCINPTHRES */

/* Bit fields for CPDMA SYNCOUTTHRES */
#define _CPDMA_SYNCOUTTHRES_RESETVALUE           0x00000101UL                                 /**< Default value for CPDMA_SYNCOUTTHRES        */
#define _CPDMA_SYNCOUTTHRES_MASK                 0x0000FFFFUL                                 /**< Mask for CPDMA_SYNCOUTTHRES                 */
#define _CPDMA_SYNCOUTTHRES_OUTTHRES1_SHIFT      0                                            /**< Shift value for CPDMA_OUTTHRES1             */
#define _CPDMA_SYNCOUTTHRES_OUTTHRES1_MASK       0xFFUL                                       /**< Bit mask for CPDMA_OUTTHRES1                */
#define _CPDMA_SYNCOUTTHRES_OUTTHRES1_DEFAULT    0x00000001UL                                 /**< Mode DEFAULT for CPDMA_SYNCOUTTHRES         */
#define CPDMA_SYNCOUTTHRES_OUTTHRES1_DEFAULT     (_CPDMA_SYNCOUTTHRES_OUTTHRES1_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_SYNCOUTTHRES */
#define _CPDMA_SYNCOUTTHRES_OUTTHRES2_SHIFT      8                                            /**< Shift value for CPDMA_OUTTHRES2             */
#define _CPDMA_SYNCOUTTHRES_OUTTHRES2_MASK       0xFF00UL                                     /**< Bit mask for CPDMA_OUTTHRES2                */
#define _CPDMA_SYNCOUTTHRES_OUTTHRES2_DEFAULT    0x00000001UL                                 /**< Mode DEFAULT for CPDMA_SYNCOUTTHRES         */
#define CPDMA_SYNCOUTTHRES_OUTTHRES2_DEFAULT     (_CPDMA_SYNCOUTTHRES_OUTTHRES2_DEFAULT << 8) /**< Shifted mode DEFAULT for CPDMA_SYNCOUTTHRES */

/* Bit fields for CPDMA SYNCCNTSTAT */
#define _CPDMA_SYNCCNTSTAT_RESETVALUE            0x00000000UL                               /**< Default value for CPDMA_SYNCCNTSTAT         */
#define _CPDMA_SYNCCNTSTAT_MASK                  0x0000FFFFUL                               /**< Mask for CPDMA_SYNCCNTSTAT                  */
#define _CPDMA_SYNCCNTSTAT_CNTSTAT1_SHIFT        0                                          /**< Shift value for CPDMA_CNTSTAT1              */
#define _CPDMA_SYNCCNTSTAT_CNTSTAT1_MASK         0xFFUL                                     /**< Bit mask for CPDMA_CNTSTAT1                 */
#define _CPDMA_SYNCCNTSTAT_CNTSTAT1_DEFAULT      0x00000000UL                               /**< Mode DEFAULT for CPDMA_SYNCCNTSTAT          */
#define CPDMA_SYNCCNTSTAT_CNTSTAT1_DEFAULT       (_CPDMA_SYNCCNTSTAT_CNTSTAT1_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_SYNCCNTSTAT  */
#define _CPDMA_SYNCCNTSTAT_CNTSTAT2_SHIFT        8                                          /**< Shift value for CPDMA_CNTSTAT2              */
#define _CPDMA_SYNCCNTSTAT_CNTSTAT2_MASK         0xFF00UL                                   /**< Bit mask for CPDMA_CNTSTAT2                 */
#define _CPDMA_SYNCCNTSTAT_CNTSTAT2_DEFAULT      0x00000000UL                               /**< Mode DEFAULT for CPDMA_SYNCCNTSTAT          */
#define CPDMA_SYNCCNTSTAT_CNTSTAT2_DEFAULT       (_CPDMA_SYNCCNTSTAT_CNTSTAT2_DEFAULT << 8) /**< Shifted mode DEFAULT for CPDMA_SYNCCNTSTAT  */

/* Bit fields for CPDMA FIFO_CONN */
#define _CPDMA_FIFO_CONN_RESETVALUE              0x00000000UL                           /**< Default value for CPDMA_FIFO_CONN           */
#define _CPDMA_FIFO_CONN_MASK                    0x00003F0FUL                           /**< Mask for CPDMA_FIFO_CONN                    */
#define _CPDMA_FIFO_CONN_FIFOID_SHIFT            0                                      /**< Shift value for CPDMA_FIFOID                */
#define _CPDMA_FIFO_CONN_FIFOID_MASK             0xFUL                                  /**< Bit mask for CPDMA_FIFOID                   */
#define _CPDMA_FIFO_CONN_FIFOID_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for CPDMA_FIFO_CONN            */
#define CPDMA_FIFO_CONN_FIFOID_DEFAULT           (_CPDMA_FIFO_CONN_FIFOID_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_FIFO_CONN    */
#define _CPDMA_FIFO_CONN_CPID_SHIFT              8                                      /**< Shift value for CPDMA_CPID                  */
#define _CPDMA_FIFO_CONN_CPID_MASK               0x3F00UL                               /**< Bit mask for CPDMA_CPID                     */
#define _CPDMA_FIFO_CONN_CPID_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for CPDMA_FIFO_CONN            */
#define CPDMA_FIFO_CONN_CPID_DEFAULT             (_CPDMA_FIFO_CONN_CPID_DEFAULT << 8)   /**< Shifted mode DEFAULT for CPDMA_FIFO_CONN    */

/* Bit fields for CPDMA CH_CFG */
#define _CPDMA_CH_CFG_RESETVALUE                 0x01000000UL                             /**< Default value for CPDMA_CH_CFG              */
#define _CPDMA_CH_CFG_MASK                       0x1FECF300UL                             /**< Mask for CPDMA_CH_CFG                       */
#define _CPDMA_CH_CFG_ILEAVESEL_SHIFT            8                                        /**< Shift value for CPDMA_ILEAVESEL             */
#define _CPDMA_CH_CFG_ILEAVESEL_MASK             0x300UL                                  /**< Bit mask for CPDMA_ILEAVESEL                */
#define _CPDMA_CH_CFG_ILEAVESEL_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for CPDMA_CH_CFG               */
#define CPDMA_CH_CFG_ILEAVESEL_DEFAULT           (_CPDMA_CH_CFG_ILEAVESEL_DEFAULT << 8)   /**< Shifted mode DEFAULT for CPDMA_CH_CFG       */
#define _CPDMA_CH_CFG_ILEAVEMODE_SHIFT           12                                       /**< Shift value for CPDMA_ILEAVEMODE            */
#define _CPDMA_CH_CFG_ILEAVEMODE_MASK            0x3000UL                                 /**< Bit mask for CPDMA_ILEAVEMODE               */
#define _CPDMA_CH_CFG_ILEAVEMODE_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for CPDMA_CH_CFG               */
#define _CPDMA_CH_CFG_ILEAVEMODE_NONE            0x00000000UL                             /**< Mode NONE for CPDMA_CH_CFG                  */
#define _CPDMA_CH_CFG_ILEAVEMODE_SOURCE          0x00000001UL                             /**< Mode SOURCE for CPDMA_CH_CFG                */
#define _CPDMA_CH_CFG_ILEAVEMODE_SINK            0x00000002UL                             /**< Mode SINK for CPDMA_CH_CFG                  */
#define CPDMA_CH_CFG_ILEAVEMODE_DEFAULT          (_CPDMA_CH_CFG_ILEAVEMODE_DEFAULT << 12) /**< Shifted mode DEFAULT for CPDMA_CH_CFG       */
#define CPDMA_CH_CFG_ILEAVEMODE_NONE             (_CPDMA_CH_CFG_ILEAVEMODE_NONE << 12)    /**< Shifted mode NONE for CPDMA_CH_CFG          */
#define CPDMA_CH_CFG_ILEAVEMODE_SOURCE           (_CPDMA_CH_CFG_ILEAVEMODE_SOURCE << 12)  /**< Shifted mode SOURCE for CPDMA_CH_CFG        */
#define CPDMA_CH_CFG_ILEAVEMODE_SINK             (_CPDMA_CH_CFG_ILEAVEMODE_SINK << 12)    /**< Shifted mode SINK for CPDMA_CH_CFG          */
#define CPDMA_CH_CFG_ILEAVEABS                   (0x1UL << 14)                            /**< Interleave Absolute Address                 */
#define _CPDMA_CH_CFG_ILEAVEABS_SHIFT            14                                       /**< Shift value for CPDMA_ILEAVEABS             */
#define _CPDMA_CH_CFG_ILEAVEABS_MASK             0x4000UL                                 /**< Bit mask for CPDMA_ILEAVEABS                */
#define _CPDMA_CH_CFG_ILEAVEABS_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for CPDMA_CH_CFG               */
#define CPDMA_CH_CFG_ILEAVEABS_DEFAULT           (_CPDMA_CH_CFG_ILEAVEABS_DEFAULT << 14)  /**< Shifted mode DEFAULT for CPDMA_CH_CFG       */
#define CPDMA_CH_CFG_FORCEREQ                    (0x1UL << 15)                            /**< Forced Request Mode                         */
#define _CPDMA_CH_CFG_FORCEREQ_SHIFT             15                                       /**< Shift value for CPDMA_FORCEREQ              */
#define _CPDMA_CH_CFG_FORCEREQ_MASK              0x8000UL                                 /**< Bit mask for CPDMA_FORCEREQ                 */
#define _CPDMA_CH_CFG_FORCEREQ_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for CPDMA_CH_CFG               */
#define _CPDMA_CH_CFG_FORCEREQ_DISABLED          0x00000000UL                             /**< Mode DISABLED for CPDMA_CH_CFG              */
#define _CPDMA_CH_CFG_FORCEREQ_ENABLED           0x00000001UL                             /**< Mode ENABLED for CPDMA_CH_CFG               */
#define CPDMA_CH_CFG_FORCEREQ_DEFAULT            (_CPDMA_CH_CFG_FORCEREQ_DEFAULT << 15)   /**< Shifted mode DEFAULT for CPDMA_CH_CFG       */
#define CPDMA_CH_CFG_FORCEREQ_DISABLED           (_CPDMA_CH_CFG_FORCEREQ_DISABLED << 15)  /**< Shifted mode DISABLED for CPDMA_CH_CFG      */
#define CPDMA_CH_CFG_FORCEREQ_ENABLED            (_CPDMA_CH_CFG_FORCEREQ_ENABLED << 15)   /**< Shifted mode ENABLED for CPDMA_CH_CFG       */
#define _CPDMA_CH_CFG_ARBDEL_SHIFT               18                                       /**< Shift value for CPDMA_ARBDEL                */
#define _CPDMA_CH_CFG_ARBDEL_MASK                0xC0000UL                                /**< Bit mask for CPDMA_ARBDEL                   */
#define _CPDMA_CH_CFG_ARBDEL_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for CPDMA_CH_CFG               */
#define CPDMA_CH_CFG_ARBDEL_DEFAULT              (_CPDMA_CH_CFG_ARBDEL_DEFAULT << 18)     /**< Shifted mode DEFAULT for CPDMA_CH_CFG       */
#define CPDMA_CH_CFG_ADDRELDIS                   (0x1UL << 21)                            /**< Address Reload Disable                      */
#define _CPDMA_CH_CFG_ADDRELDIS_SHIFT            21                                       /**< Shift value for CPDMA_ADDRELDIS             */
#define _CPDMA_CH_CFG_ADDRELDIS_MASK             0x200000UL                               /**< Bit mask for CPDMA_ADDRELDIS                */
#define _CPDMA_CH_CFG_ADDRELDIS_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for CPDMA_CH_CFG               */
#define CPDMA_CH_CFG_ADDRELDIS_DEFAULT           (_CPDMA_CH_CFG_ADDRELDIS_DEFAULT << 21)  /**< Shifted mode DEFAULT for CPDMA_CH_CFG       */
#define _CPDMA_CH_CFG_AUTODIS_SHIFT              22                                       /**< Shift value for CPDMA_AUTODIS               */
#define _CPDMA_CH_CFG_AUTODIS_MASK               0xC00000UL                               /**< Bit mask for CPDMA_AUTODIS                  */
#define _CPDMA_CH_CFG_AUTODIS_DEFAULT            0x00000000UL                             /**< Mode DEFAULT for CPDMA_CH_CFG               */
#define _CPDMA_CH_CFG_AUTODIS_NONE               0x00000000UL                             /**< Mode NONE for CPDMA_CH_CFG                  */
#define _CPDMA_CH_CFG_AUTODIS_SINGLE             0x00000001UL                             /**< Mode SINGLE for CPDMA_CH_CFG                */
#define _CPDMA_CH_CFG_AUTODIS_CYCLE              0x00000002UL                             /**< Mode CYCLE for CPDMA_CH_CFG                 */
#define _CPDMA_CH_CFG_AUTODIS_BOTH               0x00000003UL                             /**< Mode BOTH for CPDMA_CH_CFG                  */
#define CPDMA_CH_CFG_AUTODIS_DEFAULT             (_CPDMA_CH_CFG_AUTODIS_DEFAULT << 22)    /**< Shifted mode DEFAULT for CPDMA_CH_CFG       */
#define CPDMA_CH_CFG_AUTODIS_NONE                (_CPDMA_CH_CFG_AUTODIS_NONE << 22)       /**< Shifted mode NONE for CPDMA_CH_CFG          */
#define CPDMA_CH_CFG_AUTODIS_SINGLE              (_CPDMA_CH_CFG_AUTODIS_SINGLE << 22)     /**< Shifted mode SINGLE for CPDMA_CH_CFG        */
#define CPDMA_CH_CFG_AUTODIS_CYCLE               (_CPDMA_CH_CFG_AUTODIS_CYCLE << 22)      /**< Shifted mode CYCLE for CPDMA_CH_CFG         */
#define CPDMA_CH_CFG_AUTODIS_BOTH                (_CPDMA_CH_CFG_AUTODIS_BOTH << 22)       /**< Shifted mode BOTH for CPDMA_CH_CFG          */
#define _CPDMA_CH_CFG_ADDRINC_SHIFT              24                                       /**< Shift value for CPDMA_ADDRINC               */
#define _CPDMA_CH_CFG_ADDRINC_MASK               0x1F000000UL                             /**< Bit mask for CPDMA_ADDRINC                  */
#define _CPDMA_CH_CFG_ADDRINC_DEFAULT            0x00000001UL                             /**< Mode DEFAULT for CPDMA_CH_CFG               */
#define CPDMA_CH_CFG_ADDRINC_DEFAULT             (_CPDMA_CH_CFG_ADDRINC_DEFAULT << 24)    /**< Shifted mode DEFAULT for CPDMA_CH_CFG       */

