SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_cpdma.h
/* Bit fields for CPDMA CH_CTRL */
#define _CPDMA_CH_CTRL_RESETVALUE                0x22000000UL                           /**< Default value for CPDMA_CH_CTRL             */
#define _CPDMA_CH_CTRL_MASK                      0x3300FFFFUL                           /**< Mask for CPDMA_CH_CTRL                      */
#define _CPDMA_CH_CTRL_XFERCNT_SHIFT             0                                      /**< Shift value for CPDMA_XFERCNT               */
#define _CPDMA_CH_CTRL_XFERCNT_MASK              0xFFFFUL                               /**< Bit mask for CPDMA_XFERCNT                  */
#define _CPDMA_CH_CTRL_XFERCNT_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for CPDMA_CH_CTRL              */
#define CPDMA_CH_CTRL_XFERCNT_DEFAULT            (_CPDMA_CH_CTRL_XFERCNT_DEFAULT << 0)  /**< Shifted mode DEFAULT for CPDMA_CH_CTRL      */
#define _CPDMA_CH_CTRL_SIZE_SHIFT                24                                     /**< Shift value for CPDMA_SIZE                  */
#define _CPDMA_CH_CTRL_SIZE_MASK                 0x3000000UL                            /**< Bit mask for CPDMA_SIZE                     */
#define _CPDMA_CH_CTRL_SIZE_DEFAULT              0x00000002UL                           /**< Mode DEFAULT for CPDMA_CH_CTRL              */
#define _CPDMA_CH_CTRL_SIZE_BYTE                 0x00000000UL                           /**< Mode BYTE for CPDMA_CH_CTRL                 */
#define _CPDMA_CH_CTRL_SIZE_HALFWORD             0x00000001UL                           /**< Mode HALFWORD for CPDMA_CH_CTRL             */
#define _CPDMA_CH_CTRL_SIZE_WORD                 0x00000002UL                           /**< Mode WORD for CPDMA_CH_CTRL                 */
#define CPDMA_CH_CTRL_SIZE_DEFAULT               (_CPDMA_CH_CTRL_SIZE_DEFAULT << 24)    /**< Shifted mode DEFAULT for CPDMA_CH_CTRL      */
#define CPDMA_CH_CTRL_SIZE_BYTE                  (_CPDMA_CH_CTRL_SIZE_BYTE << 24)       /**< Shifted mode BYTE for CPDMA_CH_CTRL         */
#define CPDMA_CH_CTRL_SIZE_HALFWORD              (_CPDMA_CH_CTRL_SIZE_HALFWORD << 24)   /**< Shifted mode HALFWORD for CPDMA_CH_CTRL     */
#define CPDMA_CH_CTRL_SIZE_WORD                  (_CPDMA_CH_CTRL_SIZE_WORD << 24)       /**< Shifted mode WORD for CPDMA_CH_CTRL         */
#define CPDMA_CH_CTRL_DONEIEN                    (0x1UL << 28)                          /**< CPDMA Operation Done Interrupt Enab         */
#define _CPDMA_CH_CTRL_DONEIEN_SHIFT             28                                     /**< Shift value for CPDMA_DONEIEN               */
#define _CPDMA_CH_CTRL_DONEIEN_MASK              0x10000000UL                           /**< Bit mask for CPDMA_DONEIEN                  */
#define _CPDMA_CH_CTRL_DONEIEN_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for CPDMA_CH_CTRL              */
#define CPDMA_CH_CTRL_DONEIEN_DEFAULT            (_CPDMA_CH_CTRL_DONEIEN_DEFAULT << 28) /**< Shifted mode DEFAULT for CPDMA_CH_CTRL      */
#define CPDMA_CH_CTRL_REQMODE                    (0x1UL << 29)                          /**< CPDMA Request Transfer Mode Select          */
#define _CPDMA_CH_CTRL_REQMODE_SHIFT             29                                     /**< Shift value for CPDMA_REQMODE               */
#define _CPDMA_CH_CTRL_REQMODE_MASK              0x20000000UL                           /**< Bit mask for CPDMA_REQMODE                  */
#define _CPDMA_CH_CTRL_REQMODE_DEFAULT           0x00000001UL                           /**< Mode DEFAULT for CPDMA_CH_CTRL              */
#define _CPDMA_CH_CTRL_REQMODE_SINGLE            0x00000000UL                           /**< Mode SINGLE for CPDMA_CH_CTRL               */
#define _CPDMA_CH_CTRL_REQMODE_CYCLE             0x00000001UL                           /**< Mode CYCLE for CPDMA_CH_CTRL                */
#define CPDMA_CH_CTRL_REQMODE_DEFAULT            (_CPDMA_CH_CTRL_REQMODE_DEFAULT << 29) /**< Shifted mode DEFAULT for CPDMA_CH_CTRL      */
#define CPDMA_CH_CTRL_REQMODE_SINGLE             (_CPDMA_CH_CTRL_REQMODE_SINGLE << 29)  /**< Shifted mode SINGLE for CPDMA_CH_CTRL       */
#define CPDMA_CH_CTRL_REQMODE_CYCLE              (_CPDMA_CH_CTRL_REQMODE_CYCLE << 29)   /**< Shifted mode CYCLE for CPDMA_CH_CTRL        */

/* Bit fields for CPDMA CH_STARTADDR */
#define _CPDMA_CH_STARTADDR_RESETVALUE           0x00000000UL                                 /**< Default value for CPDMA_CH_STARTADDR        */
#define _CPDMA_CH_STARTADDR_MASK                 0xFFFFFFFFUL                                 /**< Mask for CPDMA_CH_STARTADDR                 */
#define _CPDMA_CH_STARTADDR_STARTADDR_SHIFT      0                                            /**< Shift value for CPDMA_STARTADDR             */
#define _CPDMA_CH_STARTADDR_STARTADDR_MASK       0xFFFFFFFFUL                                 /**< Bit mask for CPDMA_STARTADDR                */
#define _CPDMA_CH_STARTADDR_STARTADDR_DEFAULT    0x00000000UL                                 /**< Mode DEFAULT for CPDMA_CH_STARTADDR         */
#define CPDMA_CH_STARTADDR_STARTADDR_DEFAULT     (_CPDMA_CH_STARTADDR_STARTADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_CH_STARTADDR */

/* Bit fields for CPDMA CH_STAT */
#define _CPDMA_CH_STAT_RESETVALUE                0x00000000UL                           /**< Default value for CPDMA_CH_STAT             */
#define _CPDMA_CH_STAT_MASK                      0x0000FFFFUL                           /**< Mask for CPDMA_CH_STAT                      */
#define _CPDMA_CH_STAT_XFERREM_SHIFT             0                                      /**< Shift value for CPDMA_XFERREM               */
#define _CPDMA_CH_STAT_XFERREM_MASK              0xFFFFUL                               /**< Bit mask for CPDMA_XFERREM                  */
#define _CPDMA_CH_STAT_XFERREM_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for CPDMA_CH_STAT              */
#define CPDMA_CH_STAT_XFERREM_DEFAULT            (_CPDMA_CH_STAT_XFERREM_DEFAULT << 0)  /**< Shifted mode DEFAULT for CPDMA_CH_STAT      */

/* Bit fields for CPDMA CH_CURRADDR */
#define _CPDMA_CH_CURRADDR_RESETVALUE            0x00000000UL                               /**< Default value for CPDMA_CH_CURRADDR         */
#define _CPDMA_CH_CURRADDR_MASK                  0xFFFFFFFFUL                               /**< Mask for CPDMA_CH_CURRADDR                  */
#define _CPDMA_CH_CURRADDR_CURRADDR_SHIFT        0                                          /**< Shift value for CPDMA_CURRADDR              */
#define _CPDMA_CH_CURRADDR_CURRADDR_MASK         0xFFFFFFFFUL                               /**< Bit mask for CPDMA_CURRADDR                 */
#define _CPDMA_CH_CURRADDR_CURRADDR_DEFAULT      0x00000000UL                               /**< Mode DEFAULT for CPDMA_CH_CURRADDR          */
#define CPDMA_CH_CURRADDR_CURRADDR_DEFAULT       (_CPDMA_CH_CURRADDR_CURRADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for CPDMA_CH_CURRADDR  */

/** @} End of group EFR32FG25_CPDMA_BitFields */
/** @} End of group EFR32FG25_CPDMA */
/** @} End of group Parts */

#endif /* EFR32FG25_CPDMA_H */
